/*******************************************************************
 *
 * Filename: dbHndl.h
 * Date:     2012-07-08
 *
 * Description: Handles the sqlite databases
 *
 *
 *******************************************************************/

#ifndef CDbHndl_H
#define CDbHndl_H

#include <QString>
#include <QMutex>
#include <QStandardItemModel>
#include <QStringList>
#include <QtCore>
#include <QtGui>
#include <QObject>
#include <QChar>
#include <QVector>
#include "stockPlotUtil.h"
#include <QList>
#include <QTreeWidget>
#include <QTableView>

#include <QtSql>
#include <QSqlDatabase>
#include <QSqlError>
#include "yahooStockPlotUtil.h"
#include "fifo.h"
#include "common.h"
#include "linkedList.h"
// #include "extendedTable.h"

#include "inc/guiUtil/guiFinanceColor.h"
#include "inc/guiUtil/myTreeWidget.h"


// Forward declaration
class CGuiUtils;


#define SQL_STR_ASC      "ASC"
#define SQL_STR_DESC     "DESC"



// Used in stockAnalysisTab.cpp
enum SubAnalysesCompanyTypeET
{
    UNKNOW_COMPANY_TYPE,			// Okänd
    TRADING_COMPANY,                // handelsföretag
    INDUSTRIALS_COMPANY,            // Industriföretag
    BANK_COMPANY,					// Bank
    REAL_ESTATE_COMPANY,	    	// Fastighetsbolag
    UTILITIS_COMPANY,               // Allmännyttiga företag, Försörjningsbolag
    INVESTMENT_TRUST_COMPANY,    	// Investmentbolag
    UTILITIS_COMPANY_2,             // Ska tas bort, Allmännyttiga företag, Försörjningsbolag
    NOF_COMPANY_TYPE_ARR_DATA
};



//extern QStringList g_filter1DividendSortColParamLst;

enum StockIndicatorSortType
{
    SISORT_TYPE_FLOAT,
    SISORT_TYPE_TEXT
};

struct TableColumnIndicatorInfo_ST
{
    QString name;
    qint64 indicatorlMask;
    QString nameInDb;
    QString sortOrder;
    StockIndicatorSortType sortType;

};


struct NordnetBalanceIncomeSheet_ST
{
    QString yearAssetName;
    unsigned int year;
    QString assetName;
    QString assetGroup;
    double operatingIncome;
    double operatingExpensesAndDepreciation;          // Depreciation = avskrivning
    double operatingIncomeAfterDepreciation;
    double netProfitAfterTax;                         // Årets resultat efter skatt
    double earningsPerShare;
    double numberOfShares;
    double fixedAssets;                               // Anläggningstillgångar
    double currentAssets;                             // Omsättningstillgångar
    double totalAssets;                               // Summa tillgångar
    double equity;                                    // Eget kapital
    double liabilities;                               // Skulder
    double totalEquityAndLiabilities;
};


struct NordnetCompanyDescription_ST
{
    QString assetSymbol;
    QString assetName;
    QString sector;
    QString bransch;
    QString executiveDirector; // VD
    QString businessDescription;
};


enum YahooKeyStatisticsET
{
    MARKETCAP,                  // 0
    ENTERPRISEVALUE,            // 1
    TRAILINGPE,                 // 2
    FORWARDPE,                  // 3
    PEGRATIO,                   // 4
    PRICEDIVSALES,              // 5
    PRICEDIVBOOK,               // 6
    ENTERPRISEVALUEDIVREVENUE,  // 7
    ENTERPRISEVALUEDIVEBITDA,   // 8
    FISCALYEARENDS,             // 9
    MOSTRECENTQUARTER,          // 10
    PROFITMARGIN,               // 11
    OPERATINGMARGIN,            // 12
    RETURNONASSETS,             // 13
    RETURNONEQUITY,             // 14
    REVENUE,                    // 15
    REVENUEPERSHARE,            // 16
    QTRLYREVENUEGROWTH,         // 17
    GROSSPROFIT,                // 18
    EBITDA,                     // 19
    NETINCOMEAVLTOCOMMON,       // 20
    DILUTEDEPS,                 // 21
    QTRLYEARNINGSGROWTH,        // 22
    TOTALCASH,                  // 23
    TOTALCASHPERSHARE,          // 24
    TOTALDEBT,                  // 25
    TOTALDEBTDIVEQUITY,         // 26
    CURRENTRATIO,               // 27
    BOOKVALUEPERSHARE,          // 28
    OPERATINGCASHFLOW,          // 29
    LEVEREDFREECASHFLOW,        // 30
    BETA,                       // 31
    WEEK52CHANGE,               // 32
    S_AND_P500_52WEEKCHANGE,    // 33
    WEEK52HIGH,                 // 34
    WEEK52LOW,                  // 35
    DAY50MOVINGAVERAGE,         // 36
    DAY200MOVINGAVERAGE,        // 37
    AVGVOL3MONTH,               // 38
    AVGVOL10DAY,                // 39
    SHARESOUTSTANDING,          // 40
    FLOAT_,                     // 41
    PROCENTHELDBYINSIDERS,      // 42
    PROCENTHELDBYINSTITUTIONS,  // 43
    SHARESSHORT,                // 44
    SHORTRATIO,                 // 45
    SHORTPROCENTOFFLOAT,        // 46
    SHARESSHORTPRIORMONTH,      // 47
    FORWARDANNUALDIVIDENDRATE,  // 48
    FORWARDANNUALDIVIDENDYIELD, // 49
    TRAILINGANNUALDIVIDENDYIELD,    // 50
    TRAILINGANNUALDIVIDENDYIELD1,   // 51
    YEAR5AVERAGEDIVIDENDYIELD,      // 52
    PAYOUTRATIO,                // 53
    DIVIDENDDATE,               // 54
    EXDIVIDENDDATE,             // 55
    LASTSPLITFACTOR,            // 56
    LASTSPLITDATE,              // 57
    STOCKSYMBOL                 // 58
};


struct SubAnalysDataST
{
    QString date;
    QString data;
};



enum SubAnalyseDataTypeET
{
    SAD_DIVIDEND,
    SAD_EARNINGS,
    SAD_TOTAL_CURRENT_ASSETS,       // Omsättningstillgångar
    SAD_TOTAL_CURRENT_LIABILITIES,  // Kortfristiga skulder
    SAD_TOTAL_LIABILITIES,          // Totala skulder
    SAD_SOLIDITY,                   // Soliditet
    SAD_COVERAGE_RATIO,             // Räntetäckningsgrad
    SAD_CORE_TIER_1_RATIO,          // primärkapitalrelation, (Lundaluppen används ej längre)
    SAD_CORE_CAPITAL_RATIO,         // kärnprimärkapitalrelation
    SAD_CORE_EQUITY                 // Eget kapital

};






struct YahooKeyStatisticsST
{
    QString StockSymbol;
    QString MarketCap;
    QString EnterpriseValue;
    QString TrailingPe;
    QString ForwardPe;
    QString PEGRatio;
    QString PriceDivSales;
    QString PriceDivBook;
    QString EnterpriseValueDivRevenue;
    QString EnterpriseValueDivEBITDA;
    QString FiscalYearEnds;
    QString MostRecentQuarter;
    QString ProfitMargin;
    QString OperatingMargin;
    QString ReturnOnAssets;
    QString ReturnOnEquity;
    QString Revenue;
    QString RevenuePerShare;
    QString QtrlyRevenueGrowth;
    QString GrossProfit;
    QString EBITDA;
    QString NetIncomeAvlToCommon;
    QString DilutedEPS;
    QString QtrlyEarningsGrowth;
    QString TotalCash;
    QString TotalCashPerShare;
    QString TotalDebt;
    QString TotalDebtDivEquity;
    QString CurrentRatio;
    QString BookValuePerShare;
    QString OperatingCashFlow;
    QString LeveredFreeCashFlow;
    QString Beta;
    QString Week52Change;
    QString S_And_P500_52WeekChange;
    QString ProcentHeldbyInsiders;
    QString ProcentHeldbyInstitutions;
    QString SharesShort;
    QString ShortRatio;
    QString ShortProcentOfFloat;
    QString SharesShortPriorMonth;
    QString ForwardAnnualDividendRate;
    QString ForwardAnnualDividendYield;
    QString Week52High;
    QString Week52Low;
    QString Day50MovingAverage;
    QString Day200MovingAverage;
    QString AvgVol3Month;
    QString AvgVol10Day;
    QString SharesOutstanding;
    QString Float_;
    QString TrailingAnnualDividendYield;
    QString TrailingAnnualDividendYield1;
    QString Year5AverageDividendYield;
    QString PayoutRatio;
    QString DividendDate;
    QString ExDividendDate;
    QString LastSplitFactor;
    QString LastSplitDate;
};


struct HtmlStockAnalysPageDataST
{
    QString htmlStr;
    QString stockName;
    QString stockSymbol;
    QString analysisDate;
    QString companyDescription;
    QString bigEnoughAnswer;
    QString bigEnoughComment;
    QString strongFinancialPositionAnswer;
    QString strongFinancialPositionComment;
    QString earningStabilityAnswer;
    QString earningStabilityComment;
    QString dividendStabilityAnswer;
    QString dividendStabilityComment;
    QString earningGrowthAnswer;
    QString earningGrowthComment;
    QString keyValuePe;
    QString keyValuePs;
    QString keyValueNavPriceRatio;
    QString keyValueYield;
    QString keyValuePriceJEKRatio;
    QString keyValueErningsDividentRatio;
    QString keyValueTotalDebtEquityRatio;
    QString keyValueCurrentRatio;
    QString trustworthyLeadershipAnswer;
    QString trustworthyLeadershipComment;
    QString goodOwnershipAnswer;
    QString goodOwnershipComment;
    QString otherInformation;
    SubAnalysDataST *dividendDataArr;
    int nofDividendArrData;
    SubAnalysDataST *earningsDataArr;
    int nofEarningsArrData;
    SubAnalysDataST *totalCurrentAssetsArr;
    int nofTotalCurrentAssetsArrData;
    SubAnalysDataST *totalCurrentLiabilitiesArr;
    int nofTotalCurrentLiabilitiesData;
    SubAnalysDataST *totalLiabilitiesArr;
    int nofTotalLiabilitiesData;
    SubAnalysDataST *solidityArr;
    int nofSolidityData;
    SubAnalysDataST *coverageRatioArr;
    int nofCoverageRatioData;
    SubAnalysDataST *coreTier1RatioArr;
    int nofCoreTier1RatioData;
    SubAnalysDataST *equityArr;
    int nofEquityData;
    SubAnalysDataST *coreCapitalRatioArr;
    int nofCoreCapitalRatioData;


    QString  riskStdDev;
    QString  meanReturns;
    QString returnOnEquity;
};



class CExtendedTable;

class CDbHndl//: public CDbBase
{
public:

    static const quint64 MASK_GPSEL_NOT_USED;                        //  0
    static const quint64 MASK_GPSEL_STOCK_PRICE;                     //  1
    static const quint64 MASK_GPSEL_ONE_DAY_PRICE_CHANGE;            //  2
    static const quint64 MASK_GPSEL_ONE_DAY_PERCENT_CHANGE;          //  3
    static const quint64 MASK_GPSEL_BID_PRICE;                       //  4
    static const quint64 MASK_GPSEL_OFFER_PRICE;                     //  5
    static const quint64 MASK_GPSEL_HIGHEST_PRICE;                   //  6
    static const quint64 MASK_GPSEL_LOWEST_PRICE;                    //  7
    static const quint64 MASK_GPSEL_VOLUME;                          //  8
    static const quint64 MASK_GPSEL_CURRENCY;                        //  9
    static const quint64 MASK_GPSEL_TIME;                            // 10
    static const quint64 MASK_GPSEL_PE;                              // 11
    static const quint64 MASK_GPSEL_PS;                              // 12
    static const quint64 MASK_GPSEL_EARN_PER_SHARE;                  // 13
    static const quint64 MASK_GPSEL_NAV_PER_SHARE;                   // 14
    static const quint64 MASK_GPSEL_DIV_PER_SHARE;                   // 15
    static const quint64 MASK_GPSEL_YIELD;                           // 16
    static const quint64 MASK_GPSEL_COURSE_PER_NET_EQUITY;           // 17
    static const quint64 MASK_GPSEL_ONE_WEEK_PROCENT_CHANGE;         // 18
    static const quint64 MASK_GPSEL_ONE_MONTH_PERCENT_CHANGE;        // 19
    static const quint64 MASK_GPSEL_THREE_MONTH_PERCENT_CHANGE;      // 20
    static const quint64 MASK_GPSEL_SIX_MONTH_PERCENT_CHANGE;        // 21
    static const quint64 MASK_GPSEL_ONE_YEAR_PERCENT_CHANGE;         // 22
    static const quint64 MASK_GPSEL_TWO_YEAR_PERCENT_CHANGE;         // 23
    static const quint64 MASK_GPSEL_THREE_YEAR_PERCENT_CHANGE;       // 24
    static const quint64 MASK_GPSEL_FIVE_YEAR_PERCENT_CHANGE;        // 25
    static const quint64 MASK_GPSEL_STOCK_NAME;                      // 26
    static const quint64 MASK_GPSEL_EARNING_DIVIDED_BY_DIVIDEND;     // 27
    static const quint64 MASK_GPSEL_NAV_DIV_LAST_STOCK_PRICE;        // 28
    static const quint64 MASK_GPSEL_MAX_NOF_GUI_PARAMETERS;          //MAX_PRAMS

    enum GuiParamSelIndex_ET
    {
        GPSEL_INDEX_NOT_USED,                        // 0
        GPSEL_INDEX_STOCK_NAME,                      // 26
        GPSEL_INDEX_STOCK_PRICE,                     // 1
        GPSEL_INDEX_ONE_DAY_PRICE_CHANGE,            // 2
        GPSEL_INDEX_BID_PRICE,                       // 4
        GPSEL_INDEX_OFFER_PRICE,                     // 5
        GPSEL_INDEX_HIGHEST_PRICE,                   // 6
        GPSEL_INDEX_LOWEST_PRICE,                    // 7
        GPSEL_INDEX_VOLUME,                          // 8
        GPSEL_INDEX_CURRENCY,                        // 9
        GPSEL_INDEX_TIME,                            // 10
        GPSEL_INDEX_PE,                              // 11
        GPSEL_INDEX_PS,                              // 12
